[
  {
    "category": "Front-end Development",
    "experience": 6,
    "title": "HyperText Markup Language (HTML)",
    "content": "I have been a web developer for about 6 years now, and I spent two of those years teaching web development as well. As such, I have grown to have advanced knowledge of HTML. I can identify common accessibility issues and how to resolve them. I can also write correct markup with appropriate semantics. I can also do Search Engine Optimization.",
    "icon": "html5"
  },
  {
    "category": "Front-end Development",
    "experience": 5,
    "title": "Cascading Stylesheets (CSS)",
    "content": "I have an advanced knowledge of CSS. I can do responsive web design, progressive enhancement, and modern techniques. I have working knowledge on using CSS frameworks like bootstrap. I can also build you your own CSS framework and style our website from scratch.",
    "icon": "css3"
  },
  {
    "category": "Front-end Development",
    "experience": 5,
    "title": "JavaScript",
    "content": "When building websites, I reach for JavaScript only when necessary. More focus should be on HTML so webpages work for as many people as possible. JavaScript comes in to enhance the experience. I can build client-side integrations with existing REST APIs. I can also build accessible UI components without using frameworks. And I can do more than just the basics of JavaScript.",
    "icon": "javascript"
  },
  {
    "category": "Front-end Development",
    "experience": 3,
    "title": "Sass (SCSS)",
    "content": "Sass adds more fun and power in writing CSS styles. I have worked on websites with Sass since 2020. A majority of my front-end projects use Sass.",
    "icon": "sass"
  },
  {
    "category": "Development Operations",
    "experience": 4,
    "title": "Git",
    "content": "Version control will save you and your business by always keeping a backup copy of code. When a new patch update breaks your website, Git can revert back to a working version. I have 6 years' worth of working knowledge with Git. I have also several years' worth of basic development operations  (<abbr>DevOps</abbr>)  to go with it.",
    "icon": "git"
  },
  {
    "category": "Back-end Development",
    "experience": 4,
    "title": "Node.js",
    "content": "I focus on building front ends for APIs, but I am also very comfortable around building back end services. Node.js is my technology of choice when it comes to that.",
    "icon": "nodejs"
  },
  {
    "category": "Design",
    "experience": 4,
    "title": "Figma",
    "content": "When it comes to prototyping, mockups, or even the occasional graphic design, Figma is my design tool of choice. When presenting designs and concepts to clients, I either send them a link to a Figma presentation, or files exported from it. My working experience with Figma mostlyy focuses on mockups and prototyping, brand design, social media cards, and infographics.",
    "icon": "figma"
  },
  {
    "category": "Authentication, Analytics, Cloud Storage",
    "experience": 4,
    "title": "Firebase",
    "content": "My work is around JavaScript, APIs, and markup  (<abbr>Jamstack</abbr>  sites) , and I use Firebase for my back end needs. I can build integrations that center around authentication and user management. I can also build integrations for cloud storage as well as analytics.",
    "icon": "firebase"
  },
  {
    "category": "Static Site Generator",
    "experience": 3,
    "title": "Eleventy",
    "content": "I switched to Eleventy from Hexo and Jekyll for static site generation. It gives me more and easier control on how site pages are generated. I can build templates, plugins, shortcodes, and filters. I can also assemble a build system within the Eleventy ecosystem. My templating language of choice is Nunjucks and Liquid (which is also used by shopify).",
    "icon": "eleventy"
  }
]
